.emacs.gnu/Emacs.org
#+title: Emacs config
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el
#+startup: content

* Table of Contents :TOC:
- [[#notes-to-self][Notes to self]]
- [[#startup-performance][Startup performance]]
- [[#package-management][Package management]]
- [[#prevent-littering][Prevent littering]]
- [[#basic-ui][Basic UI]]
  - [[#disable-bell][disable bell]]
  - [[#line-numbers][line numbers]]
  - [[#fonts][fonts]]
  - [[#improved-scrolling][improved scrolling]]
  - [[#transparency][transparency]]
- [[#basic-functionality][Basic functionality]]
  - [[#all-the-icons][all-the-icons]]
  - [[#auto-update-packages][auto-update packages]]
- [[#keybindings][Keybindings]]
  - [[#make-escape-quit][make escape quit]]
  - [[#evil-mode][evil-mode]]
  - [[#undo-tree][undo-tree]]
  - [[#generalel][general.el]]
  - [[#generalel-generic-binds][general.el generic binds]]
  - [[#hydra][hydra]]
  - [[#window-management][window management]]
  - [[#buffer-management][buffer management]]
- [[#ui-configuration][UI Configuration]]
  - [[#ivy--counsel][ivy + counsel]]
  - [[#doom-themes][doom-themes]]
  - [[#doom-modeline][doom-modeline]]
  - [[#rainbow-delimiters][rainbow-delimiters]]
  - [[#modus-themes][modus-themes]]
  - [[#which-key][which-key]]
  - [[#helpful][helpful]]
  - [[#help-keybinds][help keybinds]]
- [[#org][Org]]
  - [[#org-fonts][org-fonts]]
  - [[#org--agenda][org + agenda]]
  - [[#bullets][bullets]]
  - [[#side-padding][side-padding]]
  - [[#org-babel][org-babel]]
  - [[#table-of-contents][table of contents]]
- [[#development][Development]]
  - [[#lsp-mode][lsp-mode]]
  - [[#languages][languages]]
  - [[#company-mode][company mode]]
  - [[#projectile][projectile]]
  - [[#magit][magit]]
  - [[#commenting][Commenting]]
- [[#terminal][Terminal]]
  - [[#term-mode][term-mode]]
  - [[#vterm][vterm]]
  - [[#shell-mode][shell-mode]]
  - [[#shell-pop][shell-pop]]
  - [[#eshell][Eshell]]
- [[#files][Files]]
  - [[#dired][Dired]]
- [[#programs][Programs]]
  - [[#ement][ement]]
  - [[#elfeed][elfeed]]
  - [[#erc][erc]]
- [[#applications][Applications]]
  - [[#xmodmap][Xmodmap]]
  - [[#mpv][mpv]]
  - [[#zshrc][zshrc]]
  - [[#firejail][Firejail]]
- [[#special][Special]]
- [[#runtime-performance][Runtime performance]]

* Notes to self

Emacs Config

+ C-x C-e to eval at point
+ M-: to eval variable
+ M-o in list for options
+ C-w window management
+ evil C-o to go back to prev location!

+ check-parens to check for errors
+ emacs-lisp-mode-map for viewing local keybinds

+ :mkdirp yes to create directories when tangling... disabled?
+ How does :noweb work?
+ keybind to search toc for link?

Q's
+ auto-revert-mode -- updates file when it changes on disk. use in some modes/files?
+ package-initialize

Look into:
- Meow since C-j and C-k will be hard in dvorak (could use alt. keys or replace?)

Reduce Emacs startup time:
- :hook
- :bind
- :commands
- :mode
- :after
- :defer

To update:
- hydra
  
* Startup performance

#+begin_src emacs-lisp

  ;; The default is 800 kilobytes (measured in bytes)
  (setq gc-cons-threshold (* 50 1000 1000))

  (defun ri/display-startup-time ()
    (message "Emacs loaded in %s with %d garbage collections."
             (format "%.2f seconds"
                     (float-time
                       (time-subtract after-init-time before-init-time)))
             gcs-done))

  (add-hook 'emacs-startup-hook #'ri/display-startup-time)
    
#+end_src

* Package management

package management, sources, auto, etc

#+begin_src emacs-lisp 

  ;; Package sources ----
  (require 'package) ; package management functions (autoloaded?)
  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
                           ("org" . "https://orgmode.org/elpa/")
                           ("elpa" . "https://elpa.gnu.org/packages/")))
  (package-initialize) ; initialize package system and prep to be used

  ;; if package-archive-contents is empty (fresh install), ----
  ;;   run package-refresh-contents. 
  (unless package-archive-contents 
   (package-refresh-contents)) 

  ;; non-Linux setup use-package ----
  ;; if use-package isn't installed or new update, then package-install it
  (unless (package-installed-p 'use-package) 
     (package-install 'use-package)) 

  ;; setup use-package ----
  (require 'use-package) 
  (setq use-package-always-ensure t) ;; no need to add :ensure t on every package that needs it
  ;(setq use-package-always-defer t) ;; explicitly state which to ensure, might break, save first
  (setq use-package-verbose t)

#+end_src

* Prevent littering

#+begin_src emacs-lisp

  ;; Change the user-emacs-directory to keep unwanted things out of ~/.emacs.d
  (setq user-emacs-directory (expand-file-name "~/.cache/emacs/")
        url-history-file (expand-file-name "url/history" user-emacs-directory))

  ;; no-littering
  (use-package no-littering)

  ;; keep autosaves in emacs dir
  (setq auto-save-file-name-transforms
      `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))

#+end_src

* Basic UI

Basic configuration of user interface.
Includes:
+ disable bell
+ line numbers
+ fonts
+ improved scrolling
+ transparency

#+begin_src emacs-lisp 
  ;; disable startup screen
  (setq inhibit-startup-message nil) 

  ;; disable ui 
  (scroll-bar-mode -1) ; disable visible scrollbar
  (tool-bar-mode -1)   ; disable the toolbar
  (tooltip-mode 1)     ; disable tooltips
  (set-fringe-mode 10) ; give some breathing room
  (menu-bar-mode -1)   ; disable menu bar

#+end_src

** disable bell

#+begin_src emacs-lisp

;; disable bell
(setq ring-bell-function 'ignore) ; TURN OFF ONCE AND FOR ALL?
(setq visual-bell 1) 

#+end_src

** line numbers

#+begin_src emacs-lisp

  ;; add line numbers
  (global-display-line-numbers-mode t)
  (column-number-mode) ; (columns on modeline)

  ;; line number mode exceptions
  (dolist (mode '(org-mode-hook
                  term-mode-hook
                  vterm-mode-hook
                  shell-mode-hook
                  eshell-mode-hook
                  treemacs-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))

#+end_src

** fonts

General fonts for emacs.
(bullets are configured in org-fonts: [[#org-fonts]] )

#+begin_src emacs-lisp

  ;; default font (modeline, minibuffer, default for applications, etc)
  (set-face-attribute 'default nil :font "Fira Code" :height 110)
  ;(set-face-attribute 'default nil :font "JetBrains Mono" :height 115) 

  ;; fixed pitch font (code blocks, property, startup, etc (can add more))
  (set-face-attribute 'fixed-pitch nil :font "Fira Code" :height 110)

  ;; variable pitch font (toc links, regular text in org, etc...)
  ;; how about Iosveka instead? 
  ;; (bullets are configured in org-fonts)
  (set-face-attribute 'variable-pitch nil :font "DejaVu Sans" :height 120 :weight 'regular)

#+end_src 

** improved scrolling

#+begin_src emacs-lisp

  (setq mouse-wheel-scroll-amount '(1 ((shift) . 1))) ;; one line at a time
  (setq mouse-wheel-progressive-speed t) ;; don't accelerate scrolling
  (setq mouse-wheel-follow-mouse 't) ;; scroll window under mouse
  (setq scroll-step 1) ;; keyboard scroll one line at a time
  (setq use-dialog-box t) ;; (change to nil) Disable dialog boxes since they weren't working in Mac OSX
  
#+end_src

** transparency

#+begin_src emacs-lisp

  ;; Set frame transparency and maximize windows by default. 
  (set-frame-parameter (selected-frame) 'alpha '(90 . 90))
  (add-to-list 'default-frame-alist '(alpha . (90 . 90)))
  (set-frame-parameter (selected-frame) 'fullscreen 'maximized)
  (add-to-list 'default-frame-alist '(fullscreen . maximized))

#+end_src

* Basic functionality

basic functionality 

** all-the-icons

#+begin_src emacs-lisp

  ;; all-the-icons
  ;; note: on a new machine, must run M-x all-the-icons-install-fonts
  (use-package all-the-icons)

#+end_src

** auto-update packages

+ M-x auto-update-package-now to run immediately
+ Updates can break Emacs, so only update when 

#+begin_src emacs-lisp

  (use-package auto-package-update
    :custom
    (auto-package-update-interval 7)
    (auto-package-update-prompt-before-update t)
    (auto-package-update-hide-results nil) ; hide pane to see what packages were updated
    :config
    (auto-package-update-maybe)
    (auto-package-update-at-time "15:00"))

#+end_src

* Keybindings

Set keybind related things here.
Includes:
+ global-set-key (<escape> as quit)
+ evil-mode
+ general.el
+ hydra
+ window management
+ buffer management
  
** make escape quit

Make <escape> quit.

#+begin_src emacs-lisp

  ;; ESC to quit prompts
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)

#+end_src

** evil-mode

#+begin_src emacs-lisp

  ;; evil-mode exclude
  (defun ri/evil-hook ()
    (dolist (mode '(custom-mode
                    eshell-mode
                    git-rebase-mode
                    erc-mode
                    circe-server-mode
                    circe-chat-mode
                    circe-query-mode
                    sauron-mode
                    term-mode))
      (add-to-list 'evil-emacs-state-modes mode)))

  ;; evil-mode
  (use-package evil
    :init
    (setq evil-want-C-u-scroll t)
    (setq evil-want-C-i-jump t)
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
    (setq evil-undo-system 'undo-tree)
    :config
    (add-hook 'evil-mode-hook 'ri/evil-hook)
    (evil-mode 1)
    (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
    (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join) ; wowie

    ;; Use visual line motions even outside of visual-line-mode buffers
    ;; -- haven't set up visual line mode yet
    (evil-global-set-key 'motion "j" 'evil-next-visual-line)
    (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

    (evil-set-initial-state 'messages-buffer-mode 'normal)
    (evil-set-initial-state 'dashboard-mode 'normal))
    ;:hook
    ;; have these programs be in emacs-mode (C-z)
    ;(evil-mode-hook . mi/evil-hook)

  ;; evil collections
  (use-package evil-collection
    :after evil
    :config
    (evil-collection-init)) 

#+end_src

** undo-tree

https://github.com/apchamberlain/undo-tree.el

#+begin_src emacs-lisp

  ;; undo-tree for evil-undo
  (use-package undo-tree
    :after evil
    :init
    (global-undo-tree-mode 1)
    :config
    (setq undo-tree-history-directory-alist '(("." . "~/.emacs.gnu/undo"))))

#+end_src

