.emacs.gnu/init.el
;; The default is 800 kilobytes (measured in bytes)
(setq gc-cons-threshold (* 50 1000 1000))

(defun ri/display-startup-time ()
  (message "Emacs loaded in %s with %d garbage collections."
           (format "%.2f seconds"
                   (float-time
                     (time-subtract after-init-time before-init-time)))
           gcs-done))

(add-hook 'emacs-startup-hook #'ri/display-startup-time)

;; Package sources ----
(require 'package) ; package management functions (autoloaded?)
(setq package-archives '(("melpa" . "https://melpa.org/packages/")
                         ("org" . "https://orgmode.org/elpa/")
                         ("elpa" . "https://elpa.gnu.org/packages/")))
(package-initialize) ; initialize package system and prep to be used

;; if package-archive-contents is empty (fresh install), ----
;;   run package-refresh-contents. 
(unless package-archive-contents 
 (package-refresh-contents)) 

;; non-Linux setup use-package ----
(unless (package-installed-p 'use-package) ; -p function (predicate: true/nil) is this installed?
   (package-install 'use-package)) ; install use-package using package-install if not installed.

;; setup use-package ----
(require 'use-package) 
(setq use-package-always-ensure t) ;; no need to add :ensure t on every package that needs it

(use-package auto-package-update
  :custom
  (auto-package-update-interval 7)
  (auto-package-update-prompt-before-update t)
  (auto-package-update-hide-results nil)
  :config
  (auto-package-update-maybe)
  (auto-package-update-at-time "14:00"))

;; Change the user-emacs-directory to keep unwanted things out of ~/.emacs.d
(setq user-emacs-directory (expand-file-name "~/.cache/emacs/")
      url-history-file (expand-file-name "url/history" user-emacs-directory))

;; no-littering
(use-package no-littering)

;; keep autosaves in emacs dir
(setq auto-save-file-name-transforms
    `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))

;; disable startup screen
(setq inhibit-startup-message nil) 

;; disable ui 
(scroll-bar-mode -1) ; disable visible scrollbar
(tool-bar-mode -1)   ; disable the toolbar
(tooltip-mode 1)     ; disable tooltips
(set-fringe-mode 10) ; give some breathing room
(menu-bar-mode -1)   ; disable menu bar

;; add line numbers
(global-display-line-numbers-mode t)
(column-number-mode) ; (columns on modeline)

;; line number mode exceptions
(dolist (mode '(org-mode-hook
                term-mode-hook
                vterm-mode-hook
                shell-mode-hook
                eshell-mode-hook
                treemacs-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))

(setq mouse-wheel-scroll-amount '(1 ((shift) . 1))) ;; one line at a time
(setq mouse-wheel-progressive-speed t) ;; don't accelerate scrolling
(setq mouse-wheel-follow-mouse 't) ;; scroll window under mouse
(setq scroll-step 1) ;; keyboard scroll one line at a time
(setq use-dialog-box t) ;; (change to nil) Disable dialog boxes since they weren't working in Mac OSX

;; disable bell
(setq ring-bell-function 'ignore) ; TURN OFF ONCE AND FOR ALL?
(setq visual-bell 1)

;; default font (modeline, minibuffer, default for applications, etc)
(set-face-attribute 'default nil :font "Fira Code" :height 110)
;(set-face-attribute 'default nil :font "JetBrains Mono" :height 115) 

;; fixed pitch font (code blocks, property, startup, etc (can add more))
(set-face-attribute 'fixed-pitch nil :font "Fira Code" :height 110)

;; variable pitch font (toc links, regular text in org, etc...)
;; how about Iosveka instead? 
;; (bullets are configured in org-fonts)
(set-face-attribute 'variable-pitch nil :font "DejaVu Sans" :height 120 :weight 'regular)

;; all-the-icons
;; note: on a new machine, must run M-x all-the-icons-install-fonts
(use-package all-the-icons)

;; ESC to quit prompts
(global-set-key (kbd "<escape>") 'keyboard-escape-quit)

;; evil-mode exclude
(defun ri/evil-hook ()
  (dolist (mode '(custom-mode
                  eshell-mode
                  git-rebase-mode
                  erc-mode
                  circe-server-mode
                  circe-chat-mode
                  circe-query-mode
                  sauron-mode
                  term-mode))
    (add-to-list 'evil-emacs-state-modes mode)))

;; evil-mode
(use-package evil
  :init
  (setq evil-want-C-u-scroll t)
  (setq evil-want-C-i-jump t)
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  (setq evil-undo-system 'undo-tree)
  :config
  (add-hook 'evil-mode-hook 'ri/evil-hook)
  (evil-mode 1)
  (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
  (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join) ; wowie

  ;; Use visual line motions even outside of visual-line-mode buffers
  ;; -- haven't set up visual line mode yet
  (evil-global-set-key 'motion "j" 'evil-next-visual-line)
  (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

  (evil-set-initial-state 'messages-buffer-mode 'normal)
  (evil-set-initial-state 'dashboard-mode 'normal))
  ;:hook
  ;; have these programs be in emacs-mode (C-z)
  ;(evil-mode-hook . mi/evil-hook)

;; evil collections
(use-package evil-collection
  :after evil
  :config
  (evil-collection-init))

;; undo-tree for evil-undo
(use-package undo-tree
  :init
  (global-undo-tree-mode 1)
  :config
  (setq undo-tree-history-directory-alist '(("." . "~/.emacs.gnu/undo"))))

;; general.el
