.emacs.gnu/Emacs.org
** general.el

https://github.com/noctuid/general.el

#+begin_src emacs-lisp

  ;; general.el
  (use-package general
    :after evil
    :config
    (general-evil-setup t)

    ;; the definer can be called to add new keybinds.
    ;; far, far better than using a bunch of
    ;;   global-set-key or define-key.
    ;; (keymaps can be swapped with states)
    (general-create-definer ri/leader-keys
      :states '(normal insert visual emacs)
      ;:keymaps '(normal insert visual emacs)
      :prefix "SPC"
      :global-prefix "C-SPC")

    ;; ;; the modes under keymaps can be put under states, right?
    ;; (general-create-definer ri/leader-keys-mode-map
    ;;   :states '(normal insert visual emacs)
    ;;   :prefix "SPC"
    ;;   :global-prefix "C-SPC")

    (general-create-definer ri/ctrl-c-keys
      :prefix "C-c"))

#+end_src

** general.el generic binds

Generic toggles

#+begin_src emacs-lisp

  (ri/leader-keys
    "t" '(:ignore t :which-key "toggles"))

#+end_src

Quit emacs / session

#+begin_src emacs-lisp

  (ri/leader-keys
    "q"  '(:ignore t :which-key "quit/session")
    "qq" '(save-buffers-kill-terminal :which-key "quit emacs"))

#+end_src

** hydra

Fast, transient keybinds

#+begin_src emacs-lisp

  ;; hydra (fast, transient keybinds)
  (use-package hydra
    :defer t)

  (defhydra hydra-text-scale (:timeout 5) 
    "scale text"
    ("j" text-scale-decrease "out")
    ("k" text-scale-increase "in")
    ("f" nil "finished" :exit t))

  (ri/leader-keys
    "ts" '(hydra-text-scale/body :which-key "scale text"))

#+end_src

** window management

#+begin_src emacs-lisp

  (ri/leader-keys
    "w"  '(:ignore t :which-key "window")
    "wv" '(evil-window-vsplit :which-key "v-split")
    "ws" '(evil-window-split :which-key "h-split")
    "wd" '(evil-window-delete :which-key "close window")
    "wc" '(evil-window-delete :which-key "close window")
    "ww" '(evil-window-next :which-key "next-window")
    "wW" '(evil-window-prev :which-key "prev-window")
    "wh" '(evil-window-left :which-key "window-left")
    "wj" '(evil-window-down :which-key "window-down")
    "wk" '(evil-window-up :which-key "window-up")
    "wl" '(evil-window-right :which-key "window-right")
    "wH" '(evil-window-move-far-left :which-key "move left")
    "wJ" '(evil-window-move-very-bottom :which-key "move down")
    "wK" '(evil-window-move-very-top :which-key "move up")
    "wL" '(evil-window-move-far-right :which-key "move right")
    "wa" '(hydra-window-adjust/body :which-key "window-ratio-adjust")
    "wi" '(:ignore t :which-key "minibuffer")
    "wie" 'minibuffer-keyboard-quit
    "wio" 'switch-to-minibuffer)

  (defhydra hydra-window-adjust (:timeout 5)
    "adjust window split ratio"
    ("h" shrink-window-horizontally "left")
    ("j" enlarge-window "down")
    ("k" shrink-window "up")
    ("l" enlarge-window-horizontally "right")
    ("c" balance-windows "balance")
    ("<enter>" nil "finished" :exit t)
    ("f" nil "finished" :exit t))

#+end_src

** buffer management

#+begin_src emacs-lisp

  (ri/leader-keys
    "b" '(:ignore t :which-key "buffer")
    "bk" '(kill-this-buffer :which-key "kill buffer")
    "bn" 'next-buffer
    "bp" 'previous-buffer
    "bo" 'evil-switch-to-windows-last-buffer
    "bb" 'counsel-switch-buffer)

#+end_src

* UI Configuration

Here we have the UI configuration.
Includes:
+ ivy
+ counsel
+ doom-themes
+ doom-modeline
+ rainbow-delimiters
+ which-key
+ helpful
+ help menu

** ivy + counsel

#+begin_src emacs-lisp

  ;; ivy
  (use-package ivy
    :diminish ; hide ivy minor-mode on modeline
    :bind (("C-s" . swiper) ;; fuzzy search tool
           :map ivy-minibuffer-map 
           ("TAB" . ivy-alt-done)	
           ("C-l" . ivy-alt-done)
           ("C-j" . ivy-next-line)
           ("C-k" . ivy-previous-line)
           :map ivy-switch-buffer-map
           ("C-k" . ivy-previous-line)
           ("C-l" . ivy-done)
           ("C-d" . ivy-switch-buffer-kill)
           :map ivy-reverse-i-search-map
           ("C-k" . ivy-previous-line)
           ("C-d" . ivy-reverse-i-search-kill))
    :config
    (message "Ivy got loaded!")
    (ivy-mode 1))

  (use-package ivy-rich
    :after ivy
    :init
    (ivy-rich-mode 1))

  ;; counsel 
  (use-package counsel
    :bind (;("M-x" . counsel-M-x)
           ;("C-x b" . counsel-ibuffer)
           ;("C-x C-f" . counsel-find-file)
           ("C-M-j" . 'counsel-switch-buffer)
           :map minibuffer-local-map
           ("C-r" . 'counsel-minibuffer-history))
    :custom
    (counsel-linux-app-format-function #'counsel-linux-app-format-function-name-only)
    :config
    (setq ivy-initial-inputs-alist nil) ;; Don't start searches with ^
    (message "Counsel loaded!")
    (counsel-mode 1))

  ;; ivy completion regex and order by last used
  (use-package ivy-prescient
    :after counsel
    :custom
    (ivy-prescient-enable-filtering nil)
    :config
    ;; Uncomment the following line to have sorting remembered across sessions!
    (prescient-persist-mode 1)
    (ivy-prescient-mode 1))

#+end_src

** doom-themes

#+begin_src emacs-lisp

  ;; doom-themes
  ;; recommended: henna, palenight, snazzy
  (use-package doom-themes
    :init 
    (load-theme 'doom-dracula t))
    ;;(load-theme 'doom-monokai-spectrum t))
    ;;(load-theme 'doom-snazzy t))

  (defun ri/load-theme-and-font-setup ()
    (interactive)
    (counsel-load-theme)
    (ri/org-font-setup))

  (ri/leader-keys
    "ht" '(ri/load-theme-and-font-setup :which-key "choose theme"))

#+end_src

** doom-modeline

#+begin_src emacs-lisp

;; doom-modeline
(use-package doom-modeline
  :init (doom-modeline-mode 1)
  :custom (doom-modeline-height 40))

#+end_src

** rainbow-delimiters

#+begin_src emacs-lisp

;; rainbow delimiters
(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))

#+end_src

** modus-themes

#+begin_src emacs-lisp

  ;; (use-package modus-themes
  ;;   :custom
  ;;   ;(modus-themes-mode-line '(borderless))
  ;;   :config
  ;;   (load-theme 'modus-vivendi t))

#+end_src

** which-key

Shows all possible completions for prefixes (C-c, C-x, SPC, etc)

https://github.com/justbur/emacs-which-key

#+begin_src emacs-lisp

  ;; which-key (lists keybinds)
  ;; (add links above source blocks later)
  (use-package which-key
    :defer 0
    :diminish which-key-mode
    :config
    (which-key-mode) 
    (setq which-key-idle-delay 0.3))

#+end_src

** helpful

Shows more info in help menu

#+begin_src emacs-lisp

  ;; helpful (improves help menu)
  (use-package helpful
    :commands (helpful-callable helpful-variable helpful-command helpful-key)
    :custom
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-function #'helpful-variable)
    :bind ;; change the function of the command
    ([remap describe-function] . counsel-describe-function)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . counsel-describe-variable)
    ([remap describe-key] . helpful-key)) 

#+end_src

** help keybinds

#+begin_src emacs-lisp

  (ri/leader-keys
    "h" '(:ignore t :which-key "help")
    "hf" 'describe-function
    "hv" 'describe-variable
    "hk" 'describe-key
    ;"hb" 'describe-bindings
    "hb" 'counsel-descbinds
    "hm" 'describe-mode
    "hg" 'customize-group
    "hP" 'describe-package
    "hp" 'helpful-at-point)

#+end_src

* Org

Configuration for org-mode
Includes:
+ org-fonts
+ bullets, side-padding, tangle, toc, etc.

** org-fonts

maybe move org-fonts below org-mode, then have a use-package org inside it to run ri/org-font-setup...

#+begin_src emacs-lisp

  (defun ri/org-font-setup ()
    (interactive)
    (dolist (face '((org-level-1 . 1.2)
                    (org-level-2 . 1.1)
                    (org-level-3 . 1.05)
                    (org-level-4 . 1.0)
                    (org-level-5 . 1.1)
                    (org-level-6 . 1.1)
                    (org-level-7 . 1.1)
                    (org-level-8 . 1.1)))
      ;; font for bullets
      (set-face-attribute (car face) nil :font "Fira Code" :weight 'regular :height (cdr face)))

  ;; Ensure that anything that should be fixed-pitch in Org files appears that way
    (set-face-attribute 'org-block nil    :foreground nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-table nil    :inherit 'fixed-pitch)
    (set-face-attribute 'org-formula nil  :inherit 'fixed-pitch)
    (set-face-attribute 'org-code nil     :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-table nil    :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-checkbox nil  :inherit 'fixed-pitch)
    (set-face-attribute 'line-number nil :inherit 'fixed-pitch)
    (set-face-attribute 'line-number-current-line nil :inherit 'fixed-pitch))

#+end_src

