.emacs.gnu/init.el
(use-package general
  :config
  (general-evil-setup t)

  ;; the definer can be called to add new keybinds.
  ;; far, far better than using a bunch of
  ;;   global-set-key or define-key.
  ;; (keymaps can be swapped with states)
  (general-create-definer ri/leader-keys
    :states '(normal insert visual emacs)
    ;:keymaps '(normal insert visual emacs)
    :prefix "SPC"
    :global-prefix "C-SPC")

  ;; ;; the modes under keymaps can be put under states, right?
  ;; (general-create-definer ri/leader-keys-mode-map
  ;;   :states '(normal insert visual emacs)
  ;;   :prefix "SPC"
  ;;   :global-prefix "C-SPC")

  (general-create-definer ri/ctrl-c-keys
    :prefix "C-c"))

(ri/leader-keys
  "t" '(:ignore t :which-key "toggles"))

(ri/leader-keys
  "q"  '(:ignore t :which-key "quit/session")
  "qq" '(save-buffers-kill-terminal :which-key "quit emacs"))

;; hydra (fast, transient keybinds)
(use-package hydra)

(defhydra hydra-text-scale (:timeout 5) 
  "scale text"
  ("j" text-scale-decrease "out")
  ("k" text-scale-increase "in")
  ("f" nil "finished" :exit t))

(ri/leader-keys
  "ts" '(hydra-text-scale/body :which-key "scale text"))

(ri/leader-keys
  "w"  '(:ignore t :which-key "window")
  "wv" '(evil-window-vsplit :which-key "v-split")
  "ws" '(evil-window-split :which-key "h-split")
  "wd" '(evil-window-delete :which-key "close window")
  "wc" '(evil-window-delete :which-key "close window")
  "ww" '(evil-window-next :which-key "next-window")
  "wW" '(evil-window-prev :which-key "prev-window")
  "wh" '(evil-window-left :which-key "window-left")
  "wj" '(evil-window-down :which-key "window-down")
  "wk" '(evil-window-up :which-key "window-up")
  "wl" '(evil-window-right :which-key "window-right")
  "wH" '(evil-window-move-far-left :which-key "move left")
  "wJ" '(evil-window-move-very-bottom :which-key "move down")
  "wK" '(evil-window-move-very-top :which-key "move up")
  "wL" '(evil-window-move-far-right :which-key "move right")
  "wa" '(hydra-window-adjust/body :which-key "window-ratio-adjust")
  "wi" '(:ignore t :which-key "minibuffer")
  "wie" 'minibuffer-keyboard-quit
  "wio" 'switch-to-minibuffer)

(defhydra hydra-window-adjust (:timeout 5)
  "adjust window split ratio"
  ("h" shrink-window-horizontally "left")
  ("j" enlarge-window "down")
  ("k" shrink-window "up")
  ("l" enlarge-window-horizontally "right")
  ("c" balance-windows "balance")
  ("<enter>" nil "finished" :exit t)
  ("f" nil "finished" :exit t))

(ri/leader-keys
  "b" '(:ignore t :which-key "buffer")
  "bk" '(kill-this-buffer :which-key "kill buffer")
  "bn" 'next-buffer
  "bp" 'previous-buffer
  "bo" 'evil-switch-to-windows-last-buffer
  "bb" 'counsel-switch-buffer)

;; ivy
(use-package ivy
  :diminish ; hide ivy minor-mode on modeline
  :bind (("C-s" . swiper) ;; fuzzy search tool
         :map ivy-minibuffer-map 
         ("TAB" . ivy-alt-done)	
         ("C-l" . ivy-alt-done)
         ("C-j" . ivy-next-line)
         ("C-k" . ivy-previous-line)
         :map ivy-switch-buffer-map
         ("C-k" . ivy-previous-line)
         ("C-l" . ivy-done)
         ("C-d" . ivy-switch-buffer-kill)
         :map ivy-reverse-i-search-map
         ("C-k" . ivy-previous-line)
         ("C-d" . ivy-reverse-i-search-kill))
  :config
  (ivy-mode 1))

(use-package ivy-rich
  :init
  (ivy-rich-mode 1))

;; counsel 
(use-package counsel
  :after (ivy)
  :bind (("M-x" . counsel-M-x)
         ("C-x b" . counsel-ibuffer)
         ("C-x C-f" . counsel-find-file)
         ("C-M-j" . 'counsel-switch-buffer)
         :map minibuffer-local-map
         ("C-r" . 'counsel-minibuffer-history))
  :config
  (setq ivy-initial-inputs-alist nil)) ;; Don't start searches with ^

;; ivy completion regex and order by last used
(use-package ivy-prescient
:after counsel
:custom
(ivy-prescient-enable-filtering nil)
:config
;; Uncomment the following line to have sorting remembered across sessions!
(prescient-persist-mode 1)
(ivy-prescient-mode 1))

;; doom-themes
;; recommended: henna, palenight, snazzy
(use-package doom-themes
  :init (load-theme 'doom-snazzy t))

(defun ri/load-theme-and-font-setup ()
  (interactive)
  (counsel-load-theme)
  (ri/org-font-setup))

(ri/leader-keys
  "ht" '(ri/load-theme-and-font-setup :which-key "choose theme"))

;; doom-modeline
(use-package doom-modeline
  :init (doom-modeline-mode 1)
  :custom (doom-modeline-height 35))

;; Set frame transparency and maximize windows by default. 
(set-frame-parameter (selected-frame) 'alpha '(90 . 90))
(add-to-list 'default-frame-alist '(alpha . (90 . 90)))
(set-frame-parameter (selected-frame) 'fullscreen 'maximized)
(add-to-list 'default-frame-alist '(fullscreen . maximized))

;; rainbow delimiters
(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))

;; which-key (lists keybinds)
;; (add links above source blocks later)
(use-package which-key
  :init (which-key-mode) 
  :diminish which-key-mode
  :config
  (setq which-key-idle-delay 0.3))

;; helpful (improves help menu)
(use-package helpful
 :custom
 (counsel-describe-function-function #'helpful-callable)
 (counsel-describe-variable-function #'helpful-variable)
 :bind ;; change the function of the command
 ([remap describe-function] . counsel-describe-function)
 ([remap describe-command] . helpful-command)
 ([remap describe-variable] . counsel-describe-variable)
 ([remap describe-key] . helpful-key))

(ri/leader-keys
  "h" '(:ignore t :which-key "help")
  "hf" 'describe-function
  "hv" 'describe-variable
  "hk" 'describe-key
  ;"hb" 'describe-bindings
  "hb" 'counsel-descbinds
  "hm" 'describe-mode
  "hP" 'describe-package
  "hp" 'helpful-at-point)

;; org
