.emacs.gnu/Emacs.org
** org-babel

code blocks and stuff

*** babel languages

#+begin_src emacs-lisp

  (with-eval-after-load 'org
    (org-babel-do-load-languages
     'org-babel-load-languages
     '((emacs-lisp . t)
       (python . t)))

    (push '("conf-unix" . conf-unix) org-src-lang-modes))

#+end_src

*** structure templates

#+begin_src emacs-lisp

  (with-eval-after-load 'org
    ;; This is needed as of Org 9.2
    (require 'org-tempo)

    (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
    (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
    (add-to-list 'org-structure-template-alist '("py" . "src python"))
    (add-to-list 'org-structure-template-alist '("un" . "src conf-unix")))

#+end_src

*** auto-tangle

#+begin_src emacs-lisp

  ;; org-babel (tangle n stuff)
  ;; Automatically tangle our Emacs.org config file when we save it
  (defun ri/org-babel-tangle-config ()
    (when (string-equal (file-name-directory (buffer-file-name))
                        (expand-file-name "~/.dotfiles/.emacs.gnu/"))
      ;;                                  ^ Formerly user-emacs-directory (now .cache/emacs/)
      ;; Dynamic scoping to the rescue
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle))))

  (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'ri/org-babel-tangle-config)))

  (ri/leader-keys
    "ob"  '(:ignore t :which-key "org-babel")
    "obt" '(org-babel-tangle :which-key "tangle")
    "obe" '(org-babel-execute-src-block :which-key "org-babel-execute-src-block"))

#+end_src

** table of contents

https://github.com/snosov1/toc-org

#+begin_src emacs-lisp

  (use-package toc-org
    :hook (org-mode . toc-org-mode))

#+end_src

* Development

** lsp-mode

https://emacs-lsp.github.io/lsp-mode/

Cool commands:
+ lsp-find-definition
+ lsp-find-references
  + lsp-ui-peek-find-references
  + lsp-treemacs-references
+ lsp-rename
+ flymake-show-buffer-diagnostics
+ lsp-execute-code-actions
+ lsp-format-buffer
+ lsp-ui-doc-focus-frame
+ lsp-ivy-workspace-symbol
  + lsp-ivy-global-workspace-symbol
+ lsp-treemacs-symbols

#+begin_src emacs-lisp

  ;; breadcrumb automatically enables...
  ;; also "file symbols" is already default args...
  (defun ri/lsp-mode-setup ()
    (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols)))

  (use-package lsp-mode
    :commands (lsp lsp-deferred)
    :hook (lsp-mode . ri/lsp-mode-setup)
    :init
    (setq lsp-keymap-prefix "C-c l")
    :config
    (lsp-enable-which-key-integration t)
    (message "lsp-mode loaded!"))

  ;; change these later...
  ;; prefix is the keys that come before?!?!
  ;; maybe i just don't have the right packages to make lsp-mode-map
  ;(ri/ctrl-c-keys
  ;; (general-define-key
  ;;   :keymaps 'lsp-mode-map
  ;;   :prefix lsp-keymap-prefix
  ;;   "l"   '(:ignore t :which-key "lsp")
  ;;   "lg"  '(:ignore t :which-key "find")
  ;;   "lgd" 'lsp-find-definition
  ;;   "lgr" 'lsp-find-references))

  ;; ;; maybe 
  ;; ;
                                          ; can't define same keys twice? naw.
  ;; ok what the heck
  ;; (ri/leader-keys
  ;;   :keymaps 'lsp-mode-map
  ;;   "ml"  '(:ignore t :which-key "lsp-find")
  ;;   "mgd" '(lsp-find-definition :wk "definition")
  ;;   "mgr" '(lsp-find-references :wk "references")
  ;;   "mrr" '(lsp-rename :wk "rename all"))

#+end_src

*** lsp-ui

https://emacs-lsp.github.io/lsp-ui/

#+begin_src emacs-lisp

  (use-package lsp-ui
    :hook (lsp-mode . lsp-ui-mode)
    :custom ;; defcustom !!
    (lsp-ui-doc-position 'bottom))

#+end_src

*** lsp-treemacs

#+begin_src emacs-lisp

  (use-package lsp-treemacs
    :after lsp)

#+end_src

*** lsp-ivy

special ivy search functionality for lsp
+ lsp-ivy-workspace-symbol

#+begin_src emacs-lisp

  (use-package lsp-ivy
    :after lsp)

#+end_src

** languages

*** Rust

https://robert.kra.hn/posts/rust-emacs-setup/

most rustic features are accessible with C-c C-c
|-------------+-----------|
| C-c C-c C-r | cargo run |
| C-c C-p     | popup     |
|             |           |


#+begin_src emacs-lisp

  ;; rust-analyzer required. gnu guix package?
  (use-package rustic
    ;:ensure t ;; no need *
    :hook (rust-mode . lsp-deferred)
    :config
    (setq rustic-format-on-save nil)

    ;; lsp-mode ----
    (lsp-rust-analyzer-cargo-watch-command "check")
    ;; enable / disable the hints as you prefer:
    (lsp-rust-analyzer-server-display-inlay-hints nil)
    (lsp-rust-analyzer-display-lifetime-elision-hints-enable "never") ; skip_trivial
    (lsp-rust-analyzer-display-chaining-hints nil)
    (lsp-rust-analyzer-display-lifetime-elision-hints-use-parameter-names nil) ; def nil
    (lsp-rust-analyzer-display-closure-return-type-hints nil)
    (lsp-rust-analyzer-display-parameter-hints nil) ; def nil
    (lsp-rust-analyzer-display-reborrow-hints "never")

    ;; lsp-ui ----
    (lsp-ui-peek-always-show nil)
    (lsp-ui-sideline-show-hover nil)
    (lsp-ui-doc-enable t))

#+end_src

*** Python

#+begin_src emacs-lisp

  (use-package python-mode
    ;:ensure t ;; no need *
    :hook (python-mode . lsp-deferred)
    :custom
     ;; NOTE: Set these if Python 3 is called "python3" on your system!
    ;; (python-shell-interpreter "python3")
    ;; (dap-python-executable "python3")
    (dap-python-debugger 'debugpy)
    :config
    (require 'dap-python))

#+end_src

** company mode

another completion framework similar to ivy.
code completion in lsp-mode.

#+begin_src emacs-lisp

  (use-package company
    :hook (lsp-mode . company-mode)
    :bind (:map company-active-map
           ("<tab>" . company-complete-selection))
          (:map lsp-mode-map
           ("<tab>" . company-indent-or-complete-common))
    :custom
    (company-minimum-prefix-length 1)
    (company-idle-delay 0.0))
    :config
    ;; fixes evil-normal and cancel company autocomplete when escape
    ;; doesn't work if escape hit very quickly
    (add-hook 'company-mode-hook
     (lambda ()
       (add-hook 'evil-normal-state-entry-hook
                 (lambda ()
                   (company-abort)))))

  (use-package company-box
    :hook (company-mode . company-box-mode))

#+end_src

** projectile

project management
bound to C-p
dir-locals are pretty cool
learn more about projectile for better project management

#+begin_src emacs-lisp

  ;; projectile
  ;; (project management)
  ;; (bound to C-p)
  ;; (dir-locals are pretty cool)
  ;; (learn more about projectile for better project management)
  (use-package projectile
    ;:defer 0
    :diminish projectile-mode
    :config (projectile-mode)
    :custom ((projectile-completion-system 'ivy)) ;; by default auto
    :bind-keymap
    ("C-c p" . projectile-command-map)
    :init
    (when (file-directory-p "~/Programming/code")
      (setq projectile-project-search-path '("~/Programming/code")))
    (setq projectile-switch-project-action #'projectile-dired))

  ;; counsel-projectile
  ;; (more options in M-o... already installed?)
  ;; (counsel-projectile-rg + M-o for a massive search in project)
  (use-package counsel-projectile
    :after projectile
    :config (counsel-projectile-mode))

  (ri/leader-keys
    "p"  '(:ignore t :which-key "project")
    "pp" 'projectile-command-map)

#+end_src

** magit

#+begin_src emacs-lisp

  ;; magit
  ;; (add several links...)
  ;; (magit-status is C-x g)
  ;; (tab to see diff of files)
  ;; (hunks, "?" for all commands, C-c C-k to quit commit, push to remote, ssh?)
  ;; (learn more about magit...)
  (use-package magit
    :commands magit-status
    :custom
    ;; what does this do? fullscreen?
    (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

  (ri/leader-keys
    "g"  '(:ignore t :which-key "magit")
    "gg" '(magit-status :which-key "magit")) ; (same as magit)

  ;; forge
  ;; (run forge-pull in a repo to pull down)
  ;; (pull down all issues, pull-reqs, etc)
  ;; (need to create a token first, then put in .authinfo)
  ;; - https://magit.vc/manual/forge/Token-Creation.html#Token-Creation
  ;; - https://magit.vc/manual/ghub/Getting-Started.html#Getting-Started
  (use-package forge
    :after magit)

#+end_src

** Commenting

#+begin_src emacs-lisp

  (use-package evil-nerd-commenter
    :bind ("M-/" . evilnc-comment-or-uncomment-lines))

#+end_src

* Terminal

** term-mode

term works on basically any device.

next and previous prompts:
+ C-c C-n
+ C-c C-p
+ [ [
+ ] ]

toggle between char and line mode:
+ C-c C-k
+ C-c C-j

if type in char and make evil edits in line mode, does not update.
- consider disabling evil completely while in term, and use zsh's vim?

#+begin_src emacs-lisp

  (use-package term
    :commands term
    :config
    (setq explicit-shell-file-name "zsh")
    (setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *"))

#+end_src

*** more colors

makes ranger work.
(depends on ncurses)

#+begin_src emacs-lisp

  (use-package eterm-256color
    :hook (term-mode . eterm-256color-mode))

#+end_src

*** ansi-term

basically the same as term but automatically renames buffers so you can spawn a bunch of them.
also prefix key changed from C-c to C-x.

** vterm

(depends on cmake, libtool-bin, and libvterm (and gcc-toolchain))

maybe try disabling evil in here? actually, it works in bash! but why no zsh?

#+begin_src emacs-lisp

  (use-package vterm
    :commands vterm
    :config
    ;; vv already set vv
    ;;(setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *")
    (setq vterm-shell "bash")
    (setq vterm-max-scrollback 10000))

#+end_src

** shell-mode

in between system shell and emacs...
- kinda broken
- can use evil editing
- counsel-shell-history

- M-p
- M-n

- not good, but works great on windows...

