.emacs.gnu/init.el
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (python . t)))

  (push '("conf-unix" . conf-unix) org-src-lang-modes))

(with-eval-after-load 'org
  ;; This is needed as of Org 9.2
  (require 'org-tempo)

  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("py" . "src python"))
  (add-to-list 'org-structure-template-alist '("co" . "src conf-unix")))

;; org-babel (tangle n stuff)
;; Automatically tangle our Emacs.org config file when we save it
(defun ri/org-babel-tangle-config ()
  (when (string-equal (file-name-directory (buffer-file-name))
                      (expand-file-name "~/.dotfiles/.emacs.gnu/"))
    ;;                                  ^ Formerly user-emacs-directory (now .cache/emacs/)
    ;; Dynamic scoping to the rescue
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

(add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'ri/org-babel-tangle-config)))

(ri/leader-keys
  "ob"  '(:ignore t :which-key "org-babel")
  "obt" '(org-babel-tangle :which-key "tangle")
  "obe" '(org-babel-execute-src-block :which-key "org-babel-execute-src-block"))

(use-package toc-org
  :hook (org-mode . toc-org-mode))

(use-package lsp-mode
  :commands (lsp lsp-deferred)
  :init
  (setq lsp-keymap-prefix "C-c l")
  :config
  (lsp-enable-which-key-integration t))

;; change these later...
;; prefix is the keys that come before?!?!
;; maybe i just don't have the right packages to make lsp-mode-map
;(ri/ctrl-c-keys
;; (general-define-key
;;   :keymaps 'lsp-mode-map
;;   :prefix lsp-keymap-prefix
;;   "l"   '(:ignore t :which-key "lsp")
;;   "lg"  '(:ignore t :which-key "find")
;;   "lgd" 'lsp-find-definition
;;   "lgr" 'lsp-find-references)

;; ;; maybe 
;; ;
                                        ; can't define same keys twice? naw.
;; ok what the heck
;; (ri/leader-keys
;;   :keymaps 'lsp-mode-map
;;   "ml"  '(:ignore t :which-key "lsp-find")
;;   "mgd" '(lsp-find-definition :wk "definition")
;;   "mgr" '(lsp-find-references :wk "references")
;;   "mrr" '(lsp-rename :wk "rename all"))

(use-package lsp-ui
  :hook (lsp-mode . lsp-ui-mode)
  :custom ;; defcustom !!
  (lsp-ui-doc-position 'bottom))

(use-package lsp-treemacs
  :after lsp)

(use-package lsp-ivy)

;; rust-analyzer required. gnu guix package?
(use-package rustic
  :ensure t
  :hook (rust-mode . lsp-deferred)
  :config
  (setq rustic-format-on-save nil))

(use-package lsp-mode
  :custom
  ;; what to use when checking on-save. use clippy instead?
  (lsp-rust-analyzer-cargo-watch-command "check")
  ;; enable / disable the hints as you prefer:
  (lsp-rust-analyzer-server-display-inlay-hints nil)
  (lsp-rust-analyzer-display-lifetime-elision-hints-enable "never") ; skip_trivial
  (lsp-rust-analyzer-display-chaining-hints nil)
  (lsp-rust-analyzer-display-lifetime-elision-hints-use-parameter-names nil) ; def nil
  (lsp-rust-analyzer-display-closure-return-type-hints nil)
  (lsp-rust-analyzer-display-parameter-hints nil) ; def nil
  (lsp-rust-analyzer-display-reborrow-hints "never"))

(use-package lsp-ui
  :custom
  (lsp-ui-peek-always-show nil)
  (lsp-ui-sideline-show-hover nil)
  (lsp-ui-doc-enable t))

(use-package python-mode
  :ensure t
  :hook (python-mode . lsp-deferred)
  :custom
   ;; NOTE: Set these if Python 3 is called "python3" on your system!
  ;; (python-shell-interpreter "python3")
  ;; (dap-python-executable "python3")
  (dap-python-debugger 'debugpy)
  :config
  (require 'dap-python))

(use-package company
  :after lsp-mode
  :hook (lsp-mode . company-mode)
  :bind (:map company-active-map
         ("<tab>" . company-complete-selection))
        (:map lsp-mode-map
         ("<tab>" . company-indent-or-complete-common))
  :custom
  (company-minimum-prefix-length 1)
  (company-idle-delay 0.0))
  :config
  ;; fixes evil-normal and cancel company autocomplete when escape
  ;; doesn't work if escape hit very quickly
  (add-hook 'company-mode-hook
   (lambda ()
     (add-hook 'evil-normal-state-entry-hook
               (lambda ()
                 (company-search-abort)))))

(use-package company-box
  :hook (company-mode . company-box-mode))

;; projectile
;; (project management)
;; (bound to C-p)
;; (dir-locals are pretty cool)
;; (learn more about projectile for better project management)
(use-package projectile
  :diminish projectile-mode
  :config (projectile-mode)
  :custom ((projectile-completion-system 'ivy)) ;; by default auto
  :bind-keymap
  ("C-c p" . projectile-command-map)
  :init
  (when (file-directory-p "~/Programming/code")
    (setq projectile-project-search-path '("~/Programming/code")))
  (setq projectile-switch-project-action #'projectile-dired))

;; counsel-projectile
;; (more options in M-o... already installed?)
;; (counsel-projectile-rg + M-o for a massive search in project)
(use-package counsel-projectile
  :config (counsel-projectile-mode))

(ri/leader-keys
  "p"  '(:ignore t :which-key "project")
  "pp" 'projectile-command-map)

;; magit
;; (add several links...)
;; (magit-status is C-x g)
;; (tab to see diff of files)
;; (hunks, "?" for all commands, C-c C-k to quit commit, push to remote, ssh?)
;; (learn more about magit...)
(use-package magit
  ;:custom
  ;(magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1)
  )

(ri/leader-keys
  "g"  '(:ignore t :which-key "magit")
  "gg" '(magit-status :which-key "magit")) ; (same as magit)

;; forge
;; (run forge-pull in a repo to pull down)
;; (pull down all issues, pull-reqs, etc)
;; (need to create a token first, then put in .authinfo)
(use-package forge)

(use-package evil-nerd-commenter
  :bind ("M-/" . evilnc-comment-or-uncomment-lines))

(use-package term
  :config
  (setq explicit-shell-file-name "zsh")
  (setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *"))

(use-package eterm-256color
  :hook (term-mode . eterm-256color-mode))

(use-package vterm
  :commands vterm
  :config
  ;; vv already set vv
  ;;(setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *")
  (setq vterm-shell "bash")
  (setq vterm-max-scrollback 10000))

;; eshell config
