.emacs.gnu/Emacs.org
** shell-pop

Hit s-<return> to bring up scratchpad terminal.

https://github.com/kyagi/shell-pop-el

#+begin_src emacs-lisp

  (use-package shell
    :commands shell-pop
    :custom
    (shell-pop-default-directory "/home/mio")
    (shell-pop-shell-type (quote ("vterm" "*vterm*" (lambda nil (vterm shell-pop-term-shell)))))
    (shell-pop-term-shell "/bin/zsh")
    (shell-pop-universal-key "C-t")
    (shell-pop-window-size 40)
    (shell-pop-window-position "bottom"))

#+end_src

** Eshell

fix neofetch
+ C-r

#+begin_src emacs-lisp

  ;; eshell config
  (defun ri/configure-eshell ()
    ;; Save command history when commands are entered.
    ;;   Commands usually don't save until close, so if crashes, loses all progress.
    (add-hook 'eshell-pre-command-hook 'eshell-save-some-history)

    ;; Truncate buffer for performance
    (add-to-list 'eshell-output-filter-functions 'eshell-truncate-buffer)

    ;; Bind some useful keys for evil-mode
    (evil-define-key '(normal insert visual) eshell-mode-map (kbd "C-r") 'counsel-esh-history)
    ;; fixes the issue with cursor going to the beginning... fixed?
    (evil-define-key '(normal insert visual) eshell-mode-map (kbd "<home>") 'eshell-bol)
    (evil-normalize-keymaps)

    (setq eshell-history-size         10000
          eshell-buffer-maximum-lines 10000
          eshell-hist-ignoredups t
          eshell-scroll-to-bottom-on-input t))

  ;; themes
  (use-package eshell-git-prompt
    :after eshell)

  (use-package eshell
    :hook (eshell-first-time-mode . ri/configure-eshell)
    :config
    (with-eval-after-load 'esh-opt
      (setq eshell-destroy-buffer-when-process-dies t)
      (setq eshell-visual-commands '("htop" "zsh" "vim" "ssh")))

    (eshell-git-prompt-use-theme 'powerline))

  (ri/leader-keys
    "ot" '(vterm :which-key "vterm")
    "oe" '(eshell :which-key "eshell"))

#+end_src

* Files

file management, etc

#+begin_src emacs-lisp

  (ri/leader-keys
    "f"  '(:ignore t :which-key "files")
    "fr" '(counsel-recentf :which-key "recent files")
    "ff" '(find-file :which-key "find-file")
    "fp" '(lambda () (interactive)
           (find-file (expand-file-name "~/.emacs.gnu/"))
             :which-key "open Emacs.org"))

#+end_src

** Dired

- Keybinds:
 |-----+------------+---+---------+----------------------+---+------+---------------------|
 |     | Marking    |   |         | Open/view/quit       |   |      | Copying/deleting/   |
 |     |            |   |         |                      |   |      | compressing         |
 |-----+------------+---+---------+----------------------+---+------+---------------------|
 | J   | search     |   | <ret>   | open file            |   | C    | copy file           |
 | m   | mark       |   | g o     | view file            |   | R    | rename/Move         |
 | %   | mark regex |   | S-<ret> | open in split window |   | % R  | rename regex        |
 | \*  | mark type  |   | M-<ret> | view file (scan)     |   | d/x  | delete selection    |
 | t   | inverts    |   | (    \) | hide info            |   | D    | delete/Trash file   |
 | u/U | unmark     |   | g r     | refresh dired        |   | Z    | compress/uncompress |
 | k/K | kill       |   | C-M-J   | ivy-immediate-done   |   | c    | compress advanced   |
 |     |            |   | H       | show/hide dots       |   |      | create empty file   |
 |     |            |   |         |                      |   |      |                     |
 |-----+------------+---+---------+----------------------+---+------+---------------------|
 |     |            |   |         |                      |   |      |                     |
 |-----+------------+---+---------+----------------------+---+------+---------------------|
 |     | Others     |   |         | Misc                 |   |      | Regex               |
 |-----+------------+---+---------+----------------------+---+------+---------------------|
 | T   | timestamp  |   | C-x C-q | Read only mode (ZZ)  |   | \&   | previous expression |
 | M   | -rw-r--r-- |   | &       | run program on file  |   | \1   |                     |
 | O   | owner      |   | I       | appends dired buffer |   | %s// |                     |
 | G   | group      |   |         |                      |   |      |                     |
 | S   | symlink    |   |         |                      |   |      |                     |
 | L   | load lisp  |   |         |                      |   |      |                     |
 |     |            |   |         |                      |   |      |                     |
 |-----+------------+---+---------+----------------------+---+------+---------------------|





#+begin_src emacs-lisp

  ;; dired 
  (use-package dired
    :ensure nil ; make sure use-package doesn't try to install it.
    :commands (dired dired-jump) ; defer loading of this config until a command is executed.
    :bind ("C-x C-j" . dired-jump)
    :custom
    (dired-listing-switches "-agho --group-directories-first")
    (dired-dwim-target t) ; auto select dir to move to if another dired window open.
    (delete-by-moving-to-trash t)
    ;;(dired-compress-files-alist) ; add more file types to compression.
    :config
    (evil-collection-define-key 'normal 'dired-mode-map
      "h" 'dired-single-up-directory
      "l" 'dired-single-buffer
      "f" 'dired-create-empty-file))
    ;;     ^ Might not work if using two dired windows! (dired-up-directory, dired-find-file)

  ;; provides dired-single commands
  ;; HAS TO COME AFTER dired because using ":after dired"
  (use-package dired-single
    :after dired)

  (use-package all-the-icons-dired
    :hook (dired-mode . all-the-icons-dired-mode))

  (use-package dired-open
    :commands (dired dired-jump)
    :config
    (setq dired-open-extensions
      '(("mkv" . "mpv")
        ("png" . "feh"))))

  (use-package dired-hide-dotfiles
    :commands (dired dired-jump)
    :config
    (evil-collection-define-key 'normal 'dired-mode-map
      "H" 'dired-hide-dotfiles-mode))

  (defun my-dired-mode-hook ()
    "My `dired` mode hook."
    ;; hide dotfiles by default
    (dired-hide-dotfiles-mode))
  ;
  (add-hook 'dired-mode-hook #'my-dired-mode-hook)

#+end_src

*Leader keys:*

#+begin_src emacs-lisp

  (ri/leader-keys
    "d"  '(:ignore t :which-key "dired")
    "dd" 'dired
    "dj" 'dired-jump)

#+end_src

* Programs

** ement

a matrix client for emacs

#+begin_src emacs-lisp

  ;; matrix client
  (use-package ement
    :commands ement)

#+end_src

** elfeed

an rss feed reader for emacs

#+begin_src emacs-lisp

  ;; rss
  ;; maybe don't need, phone is enough?
  ;; maybe syncthing and import from database?
  ;; dont use commands elfeed, scan at startup?
  (use-package elfeed
    :commands elfeed)

#+end_src

** erc

an irc client for emacs

https://github.com/alphapapa/ement.el

#+begin_src emacs-lisp

  ;; erc
  ;; make erc start after startup?
  (use-package erc
    :commands erc)

#+end_src

* Applications

unix applications go here
+ firejail

** Xmodmap

#+begin_src conf-unix :tangle ~/.dotfiles/.Xmodmap

  clear lock
  keycode 66 = Control_L Escape
  
#+end_src

** mpv

#+begin_src conf-unix :tangle ~/.dotfiles/.config/mpv/mpv.conf

  #

#+end_src

** zshrc

#+begin_src conf-unix :tangle ~/.dotfiles/.zshrc

  #
  ## config for .zshrc
  #

  # Enable colors and change prompt:
  autoload -U colors && colors
  PS1="%B%{$fg[red]%}[%{$fg[yellow]%}%n%{$fg[green]%}@%{$fg[blue]%}%M %{$fg[magenta]%}%~%{$fg[red]%}]%{$reset_color%}$%b "

  # History in cache directory:
  HISTFILE=~/.cache/zsh/history		# note: do "mkdir -p ~/.cache/zsh/" first!
  HISTSIZE=100000
  SAVEHIST=100000

  # Basic auto/tab complete:
  autoload -U compinit
  zstyle ':completion:*' menu select
  zmodload zsh/complist
  compinit
  _comp_options+=(globdots)		# Include hidden files.

  #--------------------------------------------------------------

  # vi mode
  bindkey -e # emacs, not -v (vim)
  # export KEYTIMEOUT=1

  # # Change cursor shape for different vi modes.
  # function zle-keymap-select () {
  #     case $KEYMAP in
  #         vicmd) echo -ne '\e[1 q';;      # block
  #         viins|main) echo -ne '\e[5 q';; # beam
  #     esac
  # }
  # zle-line-init() {
  #     zle -K viins # initiate `vi insert` as keymap (can be removed if `bindkey -V` has been set elsewhere)
  #     echo -ne "\e[5 q"
  # }

  # zle -N zle-keymap-select
  # zle -N zle-line-init
  # echo -ne '\e[5 q' # Use beam shape cursor on startup.
  # preexec() { echo -ne '\e[5 q' ;} # Use beam shape cursor for each new prompt.


  #--------------------------------------------------------------

  #
  ## End of main
  #

  # Export 
  export HISTORY_IGNORE="(ls|cd|pwd|exit|doas reboot|history|cd -| cd ..)"
  #export EDITOR="emacsclient -t -a ''"
  #export VISUAL="emacsclient -c -a emacs"
  #export VISUAL="emacsclient -t -a ''"
  export VISUAL="emacsclient"
  export EDITOR="$VISUAL"
  #export MANPAGER="sh -c 'col -bx | bat -l man -p'"


  # Import aliases
  [ -f "$HOME/.aliasrc" ] && source "$HOME/.aliasrc"

  # syntax highlighting plugin (https://github.com/zsh-users/zsh-syntax-highlighting)
  source /usr/share/zsh/site-functions/zsh-syntax-highlighting.zsh

  # Disable bell
  unsetopt BEEP


  # vterm integration

  vterm_printf() {
      if [ -n "$TMUX" ] && ([ "${TERM%%-*}" = "tmux" ] || [ "${TERM%%-*}" = "screen" ]); then
          # Tell tmux to pass the escape sequences through
          printf "\ePtmux;\e\e]%s\007\e\\" "$1"
      elif [ "${TERM%%-*}" = "screen" ]; then
          # GNU screen (screen, screen-256color, screen-256color-bce)
          printf "\eP\e]%s\007\e\\" "$1"
      else
          printf "\e]%s\e\\" "$1"
      fi
  }


#+end_src

** Firejail

*** disable-common.local

#+begin_src conf-unix :tangle ~/.dotfiles/.config/firejail/disable-common.local

  blacklist ${HOME}/Documents/secure
  blacklist ${HOME}/Public/School/Important-docs

#+end_src

*** keepassxc.local

#+begin_src conf-unix :tangle ~/.dotfiles/.config/firejail/keepassxc.local
  
  ## Browser Integration
  # So can access database and keyfile
  noblacklist ${HOME}/Documents/secure
  # Allow browser profile, required for browser integration (i think)
  noblacklist ${HOME}/.librewolf
  # On github wiki for needed
  noblacklist ${RUNUSER}/app
  #
  ##

  ## ETC
  # 
  #dbus-user.talk org.freedesktop.secrets
  #
  dbus-user.talk org.freedesktop.Notifications
  #
  ##

#+end_src

*** librewolf.local

#+begin_src conf-unix :tangle ~/.dotfiles/.config/firejail/librewolf.local

  #whitelist ${RUNUSER}/run/user/$UID/librewolf

  ## KeepassXC browser integration
  noblacklist ${RUNUSER}/app
  whitelist ${RUNUSER}/kpxc_server
  whitelist ${RUNUSER}/org.keepassxc.KeePassXC.BrowserServer
  #
  noblacklist ${HOME}/.mozilla
  whitelist ${HOME}/.mozilla
  #
  noblacklist ${HOME}/Documents/secure
  #

  ## ETC
  #
  # native notifications
  dbus-user.talk org.freedesktop.Notifications
  #
  # inhibiting screensavers
  dbus-user.talk org.freedesktop.ScreenSaver

#+end_src

*** steam.local

#+begin_src conf-unix :tangle ~/.dotfiles/.config/firejail/steam.local
  
  #ignore seccomp

  # private-bin is disabled while in testing, but is known to work with multiple games.
  # Add the next line to your steam.local to enable private-bin.
  #private-bin awk,basename,bash,bsdtar,bzip2,cat,chmod,cksum,cmp,comm,compress,cp,curl,cut,date,dbus-launch,dbus-send,desktop-file-edit,desktop-file-install,desktop-file-validate,dirname,echo,env,expr,file,find,getopt,grep,gtar,gzip,head,hostname,id,lbzip2,ldconfig,ldd,ln,ls,lsb_release,lsof,lspci,lz4,lzip,lzma,lzop,md5sum,mkdir,mktemp,mv,netstat,ps,pulseaudio,python*,readlink,realpath,rm,sed,sh,sha1sum,sha256sum,sha512sum,sleep,sort,steam,steamdeps,steam-native,steam-runtime,sum,tail,tar,tclsh,test,touch,tr,umask,uname,update-desktop-database,wc,wget,wget2,which,whoami,xterm,xz,zenity

  # To view screenshots add the next line to your steam.local.
  #private-bin eog,eom,gthumb,pix,viewnior,xviewer

#+end_src

* Special

Not sure if this works or not lol

#+begin_src emacs-lisp

  ;; Keep customization settings in a temporary file (does this even work?)
  (setq custom-file
        (if (boundp 'server-socket-dir)
            (expand-file-name "custom.el" server-socket-dir)
          (expand-file-name (format "emacs-custom-%s.el" (user-uid)) temporary-file-directory)))
  (load custom-file t)

#+end_src

* Runtime performance

#+begin_src emacs-lisp

  ;; make gc pauses faster by decreaseing the threshold.
  (setq gc-cons-threshold (* 2 1000 1000))
  
#+end_src

