.emacs.gnu/init.el
(defun ri/configure-eshell ()
  ;; Save command history when commands are entered.
  ;;   Commands usually don't save until close, so if crashes, loses all progress.
  (add-hook 'eshell-pre-command-hook 'eshell-save-some-history)

  ;; Truncate buffer for performance
  (add-to-list 'eshell-output-filter-functions 'eshell-truncate-buffer)

  ;; Bind some useful keys for evil-mode
  (evil-define-key '(normal insert visual) eshell-mode-map (kbd "C-r") 'counsel-esh-history)
  ;; fixes the issue with cursor going to the beginning... fixed?
  (evil-define-key '(normal insert visual) eshell-mode-map (kbd "<home>") 'eshell-bol)
  (evil-normalize-keymaps)

  (setq eshell-history-size         10000
        eshell-buffer-maximum-lines 10000
        eshell-hist-ignoredups t
        eshell-scroll-to-bottom-on-input t))

;; themes
(use-package eshell-git-prompt
  :after eshell)

(use-package eshell
  :hook (eshell-first-time-mode . ri/configure-eshell)
  :config
  (with-eval-after-load 'esh-opt
    (setq eshell-destroy-buffer-when-process-dies t)
    (setq eshell-visual-commands '("htop" "zsh" "vim" "ssh")))

  (eshell-git-prompt-use-theme 'powerline))

(ri/leader-keys
  "oe" '(eshell :which-key "eshell"))

(ri/leader-keys
  "f"  '(:ignore t :which-key "files")
  "fr" '(counsel-recentf :which-key "recent files"))

;; provides dired-single commands
(use-package dired-single)

;; dired 
(use-package dired
  :ensure nil ; make sure use-package doesn't try to install it.
  :commands (dired dired-jump) ; defer loading of this config until a command is executed.
  :bind (("C-x C-j" . dired-jump))
  :custom
  (dired-listing-switches "-agho --group-directories-first")
  (dired-dwim-target t) ; auto select dir to move to if another dired window open.
  (delete-by-moving-to-trash t)
  ;;(dired-compress-files-alist) ; add more file types to compression.
  :config
  (evil-collection-define-key 'normal 'dired-mode-map
    "h" 'dired-single-up-directory
    "l" 'dired-single-buffer))
  ;;     ^ Might not work if using two dired windows! (dired-up-directory, dired-find-file)

(use-package all-the-icons-dired
  :hook (dired-mode . all-the-icons-dired-mode))

(use-package dired-open
  :commands (dired dired-jump)
  :config
  (setq dired-open-extensions
    '(("mkv" . "mpv")
      ("png" . "feh"))))

(use-package dired-hide-dotfiles
  :hook (dired-mode . dired-hide-dotfiles-mode)
  :config
  (evil-collection-define-key 'normal 'dired-mode-map
    "H" 'dired-hide-dotfiles-mode))

(ri/leader-keys
  "d"  '(:ignore t :which-key "dired")
  "dd" 'dired
  "dj" 'dired-jump)

;; matrix client
(use-package ement)

;; rss
;; maybe don't need, phone is enough?
;; maybe syncthing and import from database?
(use-package elfeed)

;; erc
(use-package erc)

;; Keep customization settings in a temporary file (does this even work?)
(setq custom-file
      (if (boundp 'server-socket-dir)
          (expand-file-name "custom.el" server-socket-dir)
        (expand-file-name (format "emacs-custom-%s.el" (user-uid)) temporary-file-directory)))
(load custom-file t)
